//Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
//452 -> 11
//82 -> 10
//9012 -> 12

void FindSum (int num)
{
string num_tostring = num.ToString();

Console.WriteLine(num_tostring);
}
FindSum (9012);